cask_args appdir: '/Applications'
tap 'caskroom/cask'

brew 'automake'
brew 'autossh'
brew 'autoconf'

brew 'imagemagick'
brew 'mysql'
brew 'autojump'
brew 'git'
brew 'go'
brew 'cairo'
brew 'cmake'
brew 'envchain'
brew 'x264'
brew 'lame'
brew 'libvo-aacenc'
brew 'xvid'
brew 'makedepend'
brew 'openssl'
brew 'rtmpdump'
brew 'ffmpeg'
brew 'htop-osx'
brew 'hub'
brew 'nkf'
brew 'node'
brew 'peco'
brew 'phantomjs'
brew 'readline'
brew 'ruby-build', args: ['HEAD']
brew 'rbenv', args: ['HEAD']
brew 'source-highlight'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'youtube-dl'

cask 'google-chrome'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'firefox', args: { appdir: '~/my-apps/Applications' }
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'tunnelblick'
cask 'bitbar'
cask 'flux'
cask 'fantastical'
cask 'atom'
cask 'monodraw'
cask 'arq'
cask 'bittorrent-sync'
cask 'dropbox'
cask 'handbrake'
cask 'iterm2'
cask 'karabiner'
cask 'near-lock'
cask 'sequel-pro'
cask 'virtualbox'
cask 'vlc'
cask 'wireshark'

mas 'Quiver', id: 866773894
mas 'LINE', id: 539883307
mas 'Night Owl', id: 428834068
mas 'Skitch', id: 425955336
mas 'The Unarchiver', id: 425424353
mas 'Kobito', id: 896624060
mas 'Divvy', id: 413857545
mas '1Password', id: 443987910
mas 'Pomodoro Timer', id: 872515009
mas 'Media Inspector', id: 419975242
mas 'Witch', id: 412485838
mas 'Transmit', id: 403388562
mas 'OmniFocus', id: 867299399
mas 'Pushbullet', id: 948415170
mas 'LION FX', id: 768692687
mas 'Slack', id: 803453959
mas 'CotEditor', id: 1024640650
mas 'Pocket', id: 568494494
mas 'MindNode Pro', id: 402398561
